Revit 2026 API
DeleteElements Methods
The DeleteElements type exposes the following members.
Methods
Name | Description
Create(Document, ElementId) |  Creates an instance of the DeleteElements resolution.
Create(Document, IList<ElementId>)
Create(Document, ISet<ElementId>)
Dispose
(Inherited from FailureResolution)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
DeleteElements Class
Autodesk.Revit.DB Namespace